texts = {
    'level1.1': '''
        اون کارت عجیب فکر عارف رو خیلی درگیر کرده و میکه هرجور شده باید بفهمم مفهومش این چیه و چه ربطی به 
        من میتونه داشته باشه. برای همین از ما که دانشگاه رو خوب بلدیم درخواست کرده که همراهیش کنیم.🤔
عارف کارت رو رمز گشایی کرده💁🏻‍♂️ و به یکسری سر نخ ها رسیده...
(حتما "تاریخ میلادی" رو درنظر بگیرید خیلی مهمه)
    ''',
    'level1.2': 'اوه چه اتفاقی داره میفته‼️😟 این چه دستگاهی بود\n'
                '👻فکر کنم داریم تو زمان سفر میکنیم . . .',
    'level1.3': '''
    چی شد؟!😕اینجا کجاس
        توس !!😲  چرا اینجا اومدیم 
اون دستگاه کنار کامپیوتر هم با ما اومده
الان یه چیزی رو نشون میده 🤔
شبیه یک قفله ( 6 رقمیه ) 
فکر کنم برای برگشتن به موزه باید رمز اینو پیدا کنیم.
بریم یک دوری بزنیم اینجا ...
    ''',
    'level1.4': '''
        عاقا عاقا 
من اینو پشت در ورودی به آرامگاه ( مقبره ) پیدا کردم💁🏻‍♂️ فکر کنم بتونه کمکمون کنه
    ''',
    'hint1.1': '💡راهنمایی1: با تور مجازی به آرامگاه فردوسی بروید و عکس کامل را پیدا کنید',
    'hint1.2': '💡راهنمایی2: تاریخ را به میلادی تبدیل کنید',
    'level2.1': 'دوباره داره همون اتفاق میفته😵‍💫 برمیگردیم موزه',
    'level2.2': '''
        چقدر تحمل این سفر در زمان سخته
اععع رسیدیم به دانشگاه که ولی موزه ای وجود نداره که !! 

قفل دستگاه عوض شد یک چیز دگ رو داره نشون میده ( ۴ رقمیه )

این فیلم رو من قبل از اینکه بیام دانشگاه دیده بودم شما هم ببینین بد نیست خیلی قشنگه
https://www.instagram.com/p/B97BnHBAEOs/
تا وقتی که شما فیلم رو نگاه میکنید من برم دوروبر رو‌ نگاه کنم ...
    ''',
    'level2.3': 'تو مسیر یک کاغذ پیدا کردم حتما قفل با این حل میشه باید ربطش رو پیدا کنیم...',
    'level2.4': 'موقعی که موزه بودیم هم چندتا عکس گرفته بودم بیاین اونا رو هم بهتون نشون بدم',
    'level2.5': 'قفل روی دستگاه عوض شده🤡 نوشته رمز را وارد کنید.🔒 به ۴ رقم نیاز داریم ...',
    'hint2.1': '💡رویداد های که در برگه نوشته شده در چه سالی اتفاق افتاده',
    'hint2.2': '💡آن سال چه کسی رئیس دانشگاه بوده و کلمه bold شده آن چیست ؟',
    'level3.1': 'دانشکده ادبیات و الهیات اولین دانشکده هایی که تاسیس شدند  . . .',
    'level3.2': 'بریم دانشکده ادبیات🏃🏻‍♂️ چه سرودی قشنگی! خیلی شبیه یه سرودیه ولی یادم نمیاد🤦🏻‍♂️',
    'level3.3': '''
        یکی از دانشجو های رشته ی زبان ر... که داشت رد میشد یک چیزی گفت من که نفهمیدم معنی چیه
صحبتشو رکورد کردم ببینین شما میتونید بفهمید منظورش چیه(یه رمز 8 رقمیه...)
    ''',
    'hint3.1': '💡ویس به زبان روسی را در گوگل ترنسلیت ترجمه کنید و آن را در سرود دانشگاه فردوسی پیدا کنید.',
    'hint3.2': '💡در پیچ اینستاگرام و پست مربوط به باغ دانش و با توجه به ترتیب کلمات گفته شده در سرود دانشگاه فردوسی جواب رو پیدا کن.',
    'level4.1': '''
        من قبلا اینجا اومدم خیلی جای خفنیه. میگن که انگاریوم از نام انگاره به معنی «تصویرسازی ذهنی»
         گرفته‌شده. آسمان‌نما سالنی با پرده نمایش نیم‌کره داره که مخاطب داخلش با صدا و تصویر احاطه می‌شه
         و در اینجا شما می‌تونید با سفر به زمان‌ها و مکان‌های دیگه چیزهای جدید آموخته و حتی تعداد ستاره ها رو بشمرین
         و دانش خودتونو ارتقا بدین. «انگاریوم»، اولین نمونه آسمان نمای تمام بومی ایرانی بوده که با فناوری
         تصویرپردازی چند پروژکتور (قدرت گرفته از سخت‌افزار و نرم‌افزار ایرانی) تجهیز شده است و در حال کار می‌باشد🔭
         من برم ببینم چی میتونم پیدا کنم...
    ''',
    'hint4.1': '💡فرمت یکی از فایل های ارسالی رو تغییر بده و صورت های فلکی که در اون اشاره شده رو پیدا کن',
    'hint4.2': '💡عکس صورت فلکی اشاره شده رو پیدا کن و تعداد ستاره های اونها رو به ترتیب بشمار :)',
    'hint5.1': '💡نام کتاب را با سرچ در گوگل پیدا کنید',
    'hint5.2': '💡کتاب ها را در سامانه کتابخانه سرچ بزنید و شماره راهنمای آن ها را کنار هم بگذارید',
    'level6.1': 'دانشکده علوم تربیتی و کشاورزی تقریبا همزمان احداث شدند. '
                '''
                    بریم دانشکده علوم تربیتی دم در یک مردی درباره دانشکده توضیح میده 
                    🚧ولی به حرفاش زیاد گوش نکنین بریم سریع تر من میخوام اتاق معاونت آموزشی و فرهنگی رو ببینم
                ''',
    'level6.2': 'روی میز این عکسارو پیدا کردم ببینیم میشه با اینا قفل رو باز کرد🤔',
    'level6.3': '''
        از نظر کارشناسان رنگ هایی که منشا مکانی یکسانی دارند باید باهم ترکیب بشند. همچنین باید یک معنای رو القا بکنند وگرنه فایده نداره
و باید سعی کنیم از هر رنگ یک بار بیشتر استفاده نکنیم که البته همیشه برای استقلالی ها اسثناء وجود داره 😉
اونا میگن ساید خودتو باید روشن کنی یا سیاه سیاه یا ... این بین باشی حذف میشی🙂
    ''',
    'hint6.1': '💡اول باید 5 ساعت دیگه رو پیدا کنی. دو تا در زیر لینک مخفی شدن، یکی در تور افتاده و دو تا شو هم چند روز پیش براتون فرستادیم',
    'hint6.2': '''💡
🟩 و آبی فیروزه ای میشه پررنگ
زرد صورتی = کرم
⬜️ و 🟦 = آبی اسمانی 
⬛️ و 🟥 = زرشکی
    ''',
    'level7.1': '''
سال 1354
دانشکده مهندسی⚙️
توجه کردید ساختمان مهندسی رو از بالا نگاه کنید شبیه حرف E ساخته شده. حرف اولیه کلمه Engineer
    ''',
    'level7.2': '''
یکی از انجمن های اینجا هست میگن تو حوزه Game کار میکنن🎮 منم که خوراکم بازی و ایناس
بریم یک سر بزنیم بهشون...
    ''',
    'level7.3': '''
        دبیر انجمن یک لیست داد بهم گفت اگه میخوای تو انجمن ما فعالیت بکنی اینارو برای برگزاری رویدادها تدارک ببین
        قطعا ۴ کارکتر لازم داره
    ''',
    'hint7.1': '💡وارد کانال تلگرامی که در فیلم نمایش داده شد  شوید',
    'hint7.2': '💡رویداد مورد نظر را پیدا کنید و در پوستر آن رنگ شی اشاره شده را پیدا کنید',
    'level8.1': '💡دانشکده های بعدی که تاسیس شدند علوم اداری و دامپزشکی بودند. اینو هم میدونستید دانشگده دامپزشکی از بالا شبیه v دیده میشه 😅 بریم یک دوری بزنیم اونجا',
    'hint8.1': '💡عکس بیماری ها را با گوگل ایمیج سرچ کنین و نام و منشا حیوانی آن را پیدا کنین',
    'hint8.2': '''
        راهنمایی 2 : کرونا - خفاش
اچ ای وی - میمون
مالاریا - پشه
() - شتر
    ''',
    'level9.1': 'دانشکده های ورزشی ریاضی منابع طبیعی و معماری ساخته شده و خیلی ساله از تاسیسشون میگذره',
    'level9.2': '🧭دستگاه داره میگه به یک جای بخصوص باید بریم سمت شمال غرب رو نشون میده دنبالش میرم ببینم چی میشه...',
    'level9.3': '📚این کتاب ها رو انتشارات دانشگاه داد و گفتند که جای مناسبی بزارمشون که هیچ اتفاقی براشون نیفته',
    'hint9.1': '🧙🏻‍♂️مرحله آخر راهنمایی نداریم',
    'hint9.2': '🧙🏻‍♂️مرحله آخر راهنمایی نداریم',
    'congratulation': '''
تبریک 🎉
بالاخره تونستیم از این مخمصه نجات پیدا کنیم😵‍💫 و به زمان حال برگردیم🤠 نمیدونم بعد این اتفاقات عارف میاد ثبت‌نام بکنه یا نه 😜 البته این عارفی که ما میشناسیم حالا حالا ها کار داره😅 پس منتظر اتاق فرارای بعدی باشین...🧛🏻‍♂️
امیدوارم از بازی لذت برده باشین ✌🏻 خوشحال میشیم نظرتون رو در مورد مسابقه بدونیم  
 
https://survey.porsline.ir/s/5iwAHuf
    ''',
    'endmsg': '''
        خوشنودیم که در هیجان شما سهیم بودیم
ضمن تبریک به شما بابت به اتمام رساندن این بازی، از شما دعوت می‌کنیم تا باری دیگر میزبانتان باشیم در مجموعه اتاق فرار فرارستان
جهت اطلاع از کد تخفیف اختصاصی شما با شماره تلفن‌های زیر تماس بگیرید:
۰۹۰۵۲۱۹۶۲۳۱
۰۹۳۸۱۰۹۶۵۰۸
https://fararestan.ir
    ''',
    'acknowledgement': '''
♦️ برگزار شده توسط انجمن علمی Game

🧑🏻‍🎨طراحان بازی: حامد دوستی - سیروس رئوف

👨🏻‍💻برنامه نویس ربات تلگرام و سایت: <a href="https://zil.ink/soroushfathi">سروش فتحی</a>

📌با حمایت مجموعه اتاق فرار فرارستان مشهد
    ''',
}
